Tekla Open API Reference for Tekla Structures 2025
ProjectInfo.SetCurrentCoordsysToBasePoint Method
 Sets the current base point.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool SetCurrentCoordsysToBasePoint(
	BasePoint basePoint
)
Public Shared Function SetCurrentCoordsysToBasePoint (
	basePoint As BasePoint
) As Boolean
Parameters
basePoint
Type: Tekla.Structures.Model.BasePoint
The base point to be set as current base point.
Return Value
Type: Boolean
True if successful, otherwise false.
See Also
Reference
ProjectInfo Class
Tekla.Structures.Model Namespace